artillery/stressLoop.yml
config:
  target: 'http://127.0.0.1:8081'
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 120
      arrivalRate: 1
      rampTo: 5
    - duration: 240
      arrivalRate: 5
    - duration: 120
      arrivalRate: 5
      rampTo: 10
    - duration: 240
      arrivalRate: 10
    - duration: 120
      arrivalRate: 10
      rampTo: 1
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: 'Hit Restaurants at Random'
    flow:
      - loop:
        - get:
            url: "/restaurant/{{$randomNumber(1,10000000)}}/reviews"
        count: 100