artillery/stressTest.yml
config:
  target: 'http://127.0.0.1:8081'
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 120
      arrivalRate: 5
      rampTo: 50
    - duration: 240
      arrivalRate: 50
    - duration: 120
      arrivalRate: 50
      rampTo: 500
    - duration: 240
      arrivalRate: 500
    - duration: 120
      arrivalRate: 500
      rampTo: 50
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: 'Hit Restaurants at Random'
    flow:
    - get:
        url: "/restaurant/{{$randomNumber(1,10000000)}}/reviews"